Revit 2027 API
PlanCircuit.SideNum Property
The number of sides in the circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SideNum { get; }
Public ReadOnly Property SideNum As Integer
	Get
public:
property int SideNum {
	int get ();
}
member SideNum : int with get
Property Value
Int32
See Also
Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace